#include<stdio.h>

int main(){
    float a = 0.617;
    int b = 25;
    float c = 19;
    int d = 9;
    float e = 124.555;
    float f = 0.001;

    printf("a=%6.3f%%\n",a);
    printf("b=%4d%%\n",b);
    printf("c =%6.3f%%\n",c);
    printf("d  =%-2d%%\n",d);
    printf("e=%.3f%%\n",e);
    printf("f=%5.3f%%\n",f);

    return 0;

}

/*

บรรทัดที่ 1 ประกาศเรียกใช้ stdio.h
บรรทัดที่ 3 กำหนดฟังก์ชัน main
บรรทัดที่ 4 ประกาศตัวแปร float ชื่อ a มีค่าเท่ากับ 0.617
บรรทัดที่ 5 ประกาศตัวแปร int ชื่อ b มีค่าเท่ากับ 25  
บรรทัดที่ 6 ประกาศตัวแปร float ชื่อ c มีค่าเท่ากับ 19
บรรทัดที่ 7 ประกาศตัวแปร int ชื่อ d มีค่าเท่ากับ 9
บรรทัดที่ 8 ประกาศตัวแปร float ชื่อ e มีค่าเท่ากับ 124.55 
บรรทัดที่ 9 ประกาศตัวแปร float ชื่อ f มีค่าเท่ากับ 0.001
บรรทัดที่ 11 ใช้คำสั่ง printf แสดงผล a=%6.3f คือมีขนาด 6 ช่อง ติดเครื่องหมาย + คือชิดขวา กำหนดทศนิยม 3 ตำแหน่ง %% เพราะต้องการให้แสดงผล % ต่อท้าย \n ให้ขึ้นบรรทัดใหม่ โดยเรียกข้อมูลจากตัวแปร a
บรรทัดที่ 12 ใช้คำสั่ง printf แสดงผล b=%4d คือมีขนาด 4 ช่อง ติดเครื่องหมาย + คือชิดขวา เป็นจำนวนเต็ม %% เพราะต้องการให้แสดงผล % ต่อท้าย \n ให้ขึ้นบรรทัดใหม่ โดยเรียกข้อมูลจากตัวแปร b
บรรทัดที่ 13 ใช้คำสั่ง printf แสดงผล c %6.3f คือมีขนาด 6 ช่อง ติดเครื่องหมาย + คือชิดขวา กำหนดทศนิยม 3 ตำแหน่ง %% เพราะต้องการให้แสดงผล % ต่อท้าย \n ให้ขึ้นบรรทัดใหม่ โดยเรียกข้อมูลจากตัวแปร c
บรรทัดที่ 14 ใช้คำสั่ง printf แสดงผล d  =%-2d คือมีขนาด 2 ช่อง ติดเครื่องหมาย - คือชิดซ้าย ข้อมูลเป็นจำนวนเต็ม %% เพราะต้องการให้แสดงผล % ต่อท้าย \n ให้ขึ้นบรรทัดใหม่ โดยเรียกข้อมูลจากตัวแปร d
บรรทัดที่ 15 ใช้คำสั่ง printf แสดงผล e=%.3f คือ ไม่กำหนดขนาดช่อง กำหนดทศนิยม 3 ตำแหน่ง %% เพราะต้องการให้แสดงผล % ต่อท้าย \n ให้ขึ้นบรรทัดใหม่ โดยเรียกข้อมูลจากตัวแปร e
บรรทัดที่ 16 ใช้คำสั่ง printf แสดงผล f=%5.3f คือมีขนาด 5 ช่อง ติดเครื่องหมาย + คือชิดขวา กำหนดทศนิยม 3 ตำแหน่ง %% เพราะต้องการให้แสดงผล % ต่อท้าย \n ให้ขึ้นบรรทัดใหม่ โดยเรียกข้อมูลจากตัวแปร f
บรรทัดที่ 18 คืนค่าเป็น 0

*/